MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q10/mcu.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0xEC1);
#ifndef _LIB_BUILD
asm("PIE4 equ 0EC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned TMR3IE                 :1;
        unsigned TMR4IE                 :1;
        unsigned TMR5IE                 :1;
        unsigned TMR6IE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0xEC1);
// bitfield macros
#define _PIE4_TMR1IE_POSN                                   0x0
#define _PIE4_TMR1IE_POSITION                               0x0
#define _PIE4_TMR1IE_SIZE                                   0x1
#define _PIE4_TMR1IE_LENGTH                                 0x1
#define _PIE4_TMR1IE_MASK                                   0x1
#define _PIE4_TMR2IE_POSN                                   0x1
#define _PIE4_TMR2IE_POSITION                               0x1
#define _PIE4_TMR2IE_SIZE                                   0x1
#define _PIE4_TMR2IE_LENGTH                                 0x1
#define _PIE4_TMR2IE_MASK                                   0x2
#define _PIE4_TMR3IE_POSN                                   0x2
#define _PIE4_TMR3IE_POSITION                               0x2
#define _PIE4_TMR3IE_SIZE                                   0x1
#define _PIE4_TMR3IE_LENGTH                                 0x1
#define _PIE4_TMR3IE_MASK                                   0x4
#define _PIE4_TMR4IE_POSN                                   0x3
#define _PIE4_TMR4IE_POSITION                               0x3
#define _PIE4_TMR4IE_SIZE                                   0x1
#define _PIE4_TMR4IE_LENGTH                                 0x1
#define _PIE4_TMR4IE_MASK                                   0x8
#define _PIE4_TMR5IE_POSN                                   0x4
#define _PIE4_TMR5IE_POSITION                               0x4
#define _PIE4_TMR5IE_SIZE                                   0x1
#define _PIE4_TMR5IE_LENGTH                                 0x1
#define _PIE4_TMR5IE_MASK                                   0x10
#define _PIE4_TMR6IE_POSN                                   0x5
#define _PIE4_TMR6IE_POSITION                               0x5
#define _PIE4_TMR6IE_SIZE                                   0x1
#define _PIE4_TMR6IE_LENGTH                                 0x1
#define _PIE4_TMR6IE_MASK                                   0x20

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0xEC2);
#ifndef _LIB_BUILD
asm("PIE5 equ 0EC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIE                :1;
        unsigned TMR3GIE                :1;
        unsigned TMR5GIE                :1;
        unsigned                        :1;
        unsigned CLC1IE                 :1;
        unsigned CLC2IE                 :1;
        unsigned CLC3IE                 :1;
        unsigned CLC4IE                 :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0xEC2);
// bitfield macros
#define _PIE5_TMR1GIE_POSN                                  0x0
#define _PIE5_TMR1GIE_POSITION                              0x0
#define _PIE5_TMR1GIE_SIZE                                  0x1
#define _PIE5_TMR1GIE_LENGTH                                0x1
#define _PIE5_TMR1GIE_MASK                                  0x1
#define _PIE5_TMR3GIE_POSN                                  0x1
#define _PIE5_TMR3GIE_POSITION                              0x1
#define _PIE5_TMR3GIE_SIZE                                  0x1
#define _PIE5_TMR3GIE_LENGTH                                0x1
#define _PIE5_TMR3GIE_MASK                                  0x2
#define _PIE5_TMR5GIE_POSN                                  0x2
#define _PIE5_TMR5GIE_POSITION                              0x2
#define _PIE5_TMR5GIE_SIZE                                  0x1
#define _PIE5_TMR5GIE_LENGTH                                0x1
#define _PIE5_TMR5GIE_MASK                                  0x4
#define _PIE5_CLC1IE_POSN                                   0x4
#define _PIE5_CLC1IE_POSITION                               0x4
#define _PIE5_CLC1IE_SIZE                                   0x1
#define _PIE5_CLC1IE_LENGTH                                 0x1
#define _PIE5_CLC1IE_MASK                                   0x10
#define _PIE5_CLC2IE_POSN                                   0x5
#define _PIE5_CLC2IE_POSITION                               0x5
#define _PIE5_CLC2IE_SIZE                                   0x1
#define _PIE5_CLC2IE_LENGTH                                 0x1
#define _PIE5_CLC2IE_MASK                                   0x20
#define _PIE5_CLC3IE_POSN                                   0x6
#define _PIE5_CLC3IE_POSITION                               0x6
#define _PIE5_CLC3IE_SIZE                                   0x1
#define _PIE5_CLC3IE_LENGTH                                 0x1
#define _PIE5_CLC3IE_MASK                                   0x40
#define _PIE5_CLC4IE_POSN                                   0x7
#define _PIE5_CLC4IE_POSITION                               0x7
#define _PIE5_CLC4IE_SIZE                                   0x1
#define _PIE5_CLC4IE_LENGTH                                 0x1
#define _PIE5_CLC4IE_MASK                                   0x80

// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0xEC3);
#ifndef _LIB_BUILD
asm("PIE6 equ 0EC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned                        :2;
        unsigned CLC5IE                 :1;
        unsigned CLC6IE                 :1;
        unsigned CLC7IE                 :1;
        unsigned CLC8IE                 :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0xEC3);
// bitfield macros
#define _PIE6_CCP1IE_POSN                                   0x0
#define _PIE6_CCP1IE_POSITION                               0x0
#define _PIE6_CCP1IE_SIZE                                   0x1
#define _PIE6_CCP1IE_LENGTH                                 0x1
#define _PIE6_CCP1IE_MASK                                   0x1
#define _PIE6_CCP2IE_POSN                                   0x1
#define _PIE6_CCP2IE_POSITION                               0x1
#define _PIE6_CCP2IE_SIZE                                   0x1
#define _PIE6_CCP2IE_LENGTH                                 0x1
#define _PIE6_CCP2IE_MASK                                   0x2
#define _PIE6_CLC5IE_POSN                                   0x4
#define _PIE6_CLC5IE_POSITION                               0x4
#define _PIE6_CLC5IE_SIZE                                   0x1
#define _PIE6_CLC5IE_LENGTH                                 0x1
#define _PIE6_CLC5IE_MASK                                   0x10
#define _PIE6_CLC6IE_POSN                                   0x5
#define _PIE6_CLC6IE_POSITION                               0x5
#define _PIE6_CLC6IE_SIZE                                   0x1
#define _PIE6_CLC6IE_LENGTH                                 0x1
#define _PIE6_CLC6IE_MASK                                   0x20
#define _PIE6_CLC7IE_POSN                                   0x6
#define _PIE6_CLC7IE_POSITION                               0x6
#define _PIE6_CLC7IE_SIZE                                   0x1
#define _PIE6_CLC7IE_LENGTH                                 0x1
#define _PIE6_CLC7IE_MASK                                   0x40
#define _PIE6_CLC8IE_POSN                                   0x7
#define _PIE6_CLC8IE_POSITION                               0x7
#define _PIE6_CLC8IE_SIZE                                   0x1
#define _PIE6_CLC8IE_LENGTH                                 0x1
#define _PIE6_CLC8IE_MASK                                   0x80

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0xEC4);
#ifndef _LIB_BUILD
asm("PIE7 equ 0EC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWGIE                  :1;
        unsigned                        :4;
        unsigned NVMIE                  :1;
        unsigned CRCIE                  :1;
        unsigned SCANIE                 :1;
    };
    struct {
        unsigned CWG1IE                 :1;
    };
} PIE7bits_t;
