MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q10/mcu.h
extern volatile __bit                   CCP1OUT             __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x7D40);	// @ (0xFA8 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x7D41);	// @ (0xFA8 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x7D3F);	// @ (0xFA7 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE6<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7619);	// @ (0xEC3 * 8 + 1)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR6,1)
// PMD3<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x76F9);	// @ (0xEDF * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD3,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x7D38);	// @ (0xFA7 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x7D39);	// @ (0xFA7 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x7D3A);	// @ (0xFA7 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x7D3B);	// @ (0xFA7 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x7D3D);	// @ (0xFA7 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x76A2);	// @ (0xED4 * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x76A3);	// @ (0xED4 * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// MDCON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 CHPOL_bit           _BIT_ACCESS(MDCON1,5)
// MDCARH<CHS0>
extern volatile __bit                   CHS0                __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 CHS0_bit            _BIT_ACCESS(MDCARH,0)
// MDCARH<CHS1>
extern volatile __bit                   CHS1                __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 CHS1_bit            _BIT_ACCESS(MDCARH,1)
// MDCARH<CHS2>
extern volatile __bit                   CHS2                __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 CHS2_bit            _BIT_ACCESS(MDCARH,2)
// MDCON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 CHSYNC_bit          _BIT_ACCESS(MDCON1,4)
// CK2PPS<CK2PPS0>
extern volatile __bit                   CK2PPS0             __at(0x7448);	// @ (0xE89 * 8 + 0)
#define                                 CK2PPS0_bit         _BIT_ACCESS(CK2PPS,0)
// CK2PPS<CK2PPS1>
extern volatile __bit                   CK2PPS1             __at(0x7449);	// @ (0xE89 * 8 + 1)
#define                                 CK2PPS1_bit         _BIT_ACCESS(CK2PPS,1)
// CK2PPS<CK2PPS2>
extern volatile __bit                   CK2PPS2             __at(0x744A);	// @ (0xE89 * 8 + 2)
#define                                 CK2PPS2_bit         _BIT_ACCESS(CK2PPS,2)
// CK2PPS<CK2PPS3>
extern volatile __bit                   CK2PPS3             __at(0x744B);	// @ (0xE89 * 8 + 3)
#define                                 CK2PPS3_bit         _BIT_ACCESS(CK2PPS,3)
// CK2PPS<CK2PPS4>
extern volatile __bit                   CK2PPS4             __at(0x744C);	// @ (0xE89 * 8 + 4)
#define                                 CK2PPS4_bit         _BIT_ACCESS(CK2PPS,4)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7CA6);	// @ (0xF94 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7486);	// @ (0xE90 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7CAC);	// @ (0xF95 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// PIE5<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x7614);	// @ (0xEC2 * 8 + 4)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x7654);	// @ (0xECA * 8 + 4)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR5,4)
// IPR5<CLC1IP>
extern volatile __bit                   CLC1IP              __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 CLC1IP_bit          _BIT_ACCESS(IPR5,4)
// PMD5<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x770C);	// @ (0xEE1 * 8 + 4)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD5,4)
// PIE5<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x7615);	// @ (0xEC2 * 8 + 5)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x7655);	// @ (0xECA * 8 + 5)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR5,5)
// IPR5<CLC2IP>
extern volatile __bit                   CLC2IP              __at(0x75D5);	// @ (0xEBA * 8 + 5)
#define                                 CLC2IP_bit          _BIT_ACCESS(IPR5,5)
// PMD5<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x770D);	// @ (0xEE1 * 8 + 5)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD5,5)
// PIE5<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x7616);	// @ (0xEC2 * 8 + 6)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE5,6)
// PIR5<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x7656);	// @ (0xECA * 8 + 6)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR5,6)
// IPR5<CLC3IP>
extern volatile __bit                   CLC3IP              __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 CLC3IP_bit          _BIT_ACCESS(IPR5,6)
// PMD5<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x770E);	// @ (0xEE1 * 8 + 6)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD5,6)
// PIE5<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x7617);	// @ (0xEC2 * 8 + 7)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x7657);	// @ (0xECA * 8 + 7)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR5,7)
// IPR5<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 CLC4IP_bit          _BIT_ACCESS(IPR5,7)
// PMD5<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x770F);	// @ (0xEE1 * 8 + 7)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD5,7)
// PIE6<CLC5IE>
extern volatile __bit                   CLC5IE              __at(0x761C);	// @ (0xEC3 * 8 + 4)
#define                                 CLC5IE_bit          _BIT_ACCESS(PIE6,4)
// PIR6<CLC5IF>
extern volatile __bit                   CLC5IF              __at(0x765C);	// @ (0xECB * 8 + 4)
#define                                 CLC5IF_bit          _BIT_ACCESS(PIR6,4)
// IPR6<CLC5IP>
extern volatile __bit                   CLC5IP              __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 CLC5IP_bit          _BIT_ACCESS(IPR6,4)
// PMD3<CLC5MD>
extern volatile __bit                   CLC5MD              __at(0x76FC);	// @ (0xEDF * 8 + 4)
#define                                 CLC5MD_bit          _BIT_ACCESS(PMD3,4)
// PIE6<CLC6IE>
extern volatile __bit                   CLC6IE              __at(0x761D);	// @ (0xEC3 * 8 + 5)
#define                                 CLC6IE_bit          _BIT_ACCESS(PIE6,5)
// PIR6<CLC6IF>
extern volatile __bit                   CLC6IF              __at(0x765D);	// @ (0xECB * 8 + 5)
#define                                 CLC6IF_bit          _BIT_ACCESS(PIR6,5)
// IPR6<CLC6IP>
extern volatile __bit                   CLC6IP              __at(0x75DD);	// @ (0xEBB * 8 + 5)
#define                                 CLC6IP_bit          _BIT_ACCESS(IPR6,5)
// PMD3<CLC6MD>
extern volatile __bit                   CLC6MD              __at(0x76FD);	// @ (0xEDF * 8 + 5)
#define                                 CLC6MD_bit          _BIT_ACCESS(PMD3,5)
// PIE6<CLC7IE>
extern volatile __bit                   CLC7IE              __at(0x761E);	// @ (0xEC3 * 8 + 6)
#define                                 CLC7IE_bit          _BIT_ACCESS(PIE6,6)
// PIR6<CLC7IF>
extern volatile __bit                   CLC7IF              __at(0x765E);	// @ (0xECB * 8 + 6)
#define                                 CLC7IF_bit          _BIT_ACCESS(PIR6,6)
// IPR6<CLC7IP>
extern volatile __bit                   CLC7IP              __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 CLC7IP_bit          _BIT_ACCESS(IPR6,6)
// PMD3<CLC7MD>
extern volatile __bit                   CLC7MD              __at(0x76FE);	// @ (0xEDF * 8 + 6)
#define                                 CLC7MD_bit          _BIT_ACCESS(PMD3,6)
// PIE6<CLC8IE>
extern volatile __bit                   CLC8IE              __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 CLC8IE_bit          _BIT_ACCESS(PIE6,7)
// PIR6<CLC8IF>
extern volatile __bit                   CLC8IF              __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 CLC8IF_bit          _BIT_ACCESS(PIR6,7)
// IPR6<CLC8IP>
extern volatile __bit                   CLC8IP              __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 CLC8IP_bit          _BIT_ACCESS(IPR6,7)
// PMD3<CLC8MD>
extern volatile __bit                   CLC8MD              __at(0x76FF);	// @ (0xEDF * 8 + 7)
#define                                 CLC8MD_bit          _BIT_ACCESS(PMD3,7)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0x70F8);	// @ (0xE1F * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0x70F9);	// @ (0xE1F * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0x70FA);	// @ (0xE1F * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0x70FB);	// @ (0xE1F * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0x70FC);	// @ (0xE1F * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0x7102);	// @ (0xE20 * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0x7103);	// @ (0xE20 * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0x7104);	// @ (0xE20 * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0x7108);	// @ (0xE21 * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0x710A);	// @ (0xE21 * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0x710B);	// @ (0xE21 * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0x710C);	// @ (0xE21 * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0x7110);	// @ (0xE22 * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0x7111);	// @ (0xE22 * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0x7112);	// @ (0xE22 * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0x7113);	// @ (0xE22 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLCIN4PPS<CLCIN4PPS0>
extern volatile __bit                   CLCIN4PPS0          __at(0x7118);	// @ (0xE23 * 8 + 0)
#define                                 CLCIN4PPS0_bit      _BIT_ACCESS(CLCIN4PPS,0)
// CLCIN4PPS<CLCIN4PPS1>
extern volatile __bit                   CLCIN4PPS1          __at(0x7119);	// @ (0xE23 * 8 + 1)
#define                                 CLCIN4PPS1_bit      _BIT_ACCESS(CLCIN4PPS,1)
// CLCIN4PPS<CLCIN4PPS2>
extern volatile __bit                   CLCIN4PPS2          __at(0x711A);	// @ (0xE23 * 8 + 2)
#define                                 CLCIN4PPS2_bit      _BIT_ACCESS(CLCIN4PPS,2)
// CLCIN4PPS<CLCIN4PPS3>
extern volatile __bit                   CLCIN4PPS3          __at(0x711B);	// @ (0xE23 * 8 + 3)
#define                                 CLCIN4PPS3_bit      _BIT_ACCESS(CLCIN4PPS,3)
// CLCIN4PPS<CLCIN4PPS4>
extern volatile __bit                   CLCIN4PPS4          __at(0x711C);	// @ (0xE23 * 8 + 4)
#define                                 CLCIN4PPS4_bit      _BIT_ACCESS(CLCIN4PPS,4)
// CLCIN5PPS<CLCIN5PPS0>
extern volatile __bit                   CLCIN5PPS0          __at(0x7120);	// @ (0xE24 * 8 + 0)
#define                                 CLCIN5PPS0_bit      _BIT_ACCESS(CLCIN5PPS,0)
// CLCIN5PPS<CLCIN5PPS1>
extern volatile __bit                   CLCIN5PPS1          __at(0x7121);	// @ (0xE24 * 8 + 1)
#define                                 CLCIN5PPS1_bit      _BIT_ACCESS(CLCIN5PPS,1)
// CLCIN5PPS<CLCIN5PPS2>
extern volatile __bit                   CLCIN5PPS2          __at(0x7122);	// @ (0xE24 * 8 + 2)
#define                                 CLCIN5PPS2_bit      _BIT_ACCESS(CLCIN5PPS,2)
// CLCIN5PPS<CLCIN5PPS3>
extern volatile __bit                   CLCIN5PPS3          __at(0x7123);	// @ (0xE24 * 8 + 3)
#define                                 CLCIN5PPS3_bit      _BIT_ACCESS(CLCIN5PPS,3)
// CLCIN5PPS<CLCIN5PPS4>
extern volatile __bit                   CLCIN5PPS4          __at(0x7124);	// @ (0xE24 * 8 + 4)
#define                                 CLCIN5PPS4_bit      _BIT_ACCESS(CLCIN5PPS,4)
// CLCIN6PPS<CLCIN6PPS0>
extern volatile __bit                   CLCIN6PPS0          __at(0x7128);	// @ (0xE25 * 8 + 0)
#define                                 CLCIN6PPS0_bit      _BIT_ACCESS(CLCIN6PPS,0)
// CLCIN6PPS<CLCIN6PPS1>
extern volatile __bit                   CLCIN6PPS1          __at(0x7129);	// @ (0xE25 * 8 + 1)
#define                                 CLCIN6PPS1_bit      _BIT_ACCESS(CLCIN6PPS,1)
// CLCIN6PPS<CLCIN6PPS2>
extern volatile __bit                   CLCIN6PPS2          __at(0x712A);	// @ (0xE25 * 8 + 2)
#define                                 CLCIN6PPS2_bit      _BIT_ACCESS(CLCIN6PPS,2)
// CLCIN6PPS<CLCIN6PPS3>
extern volatile __bit                   CLCIN6PPS3          __at(0x712B);	// @ (0xE25 * 8 + 3)
#define                                 CLCIN6PPS3_bit      _BIT_ACCESS(CLCIN6PPS,3)
// CLCIN6PPS<CLCIN6PPS4>
extern volatile __bit                   CLCIN6PPS4          __at(0x712C);	// @ (0xE25 * 8 + 4)
#define                                 CLCIN6PPS4_bit      _BIT_ACCESS(CLCIN6PPS,4)
// CLCIN7PPS<CLCIN7PPS0>
extern volatile __bit                   CLCIN7PPS0          __at(0x7130);	// @ (0xE26 * 8 + 0)
#define                                 CLCIN7PPS0_bit      _BIT_ACCESS(CLCIN7PPS,0)
// CLCIN7PPS<CLCIN7PPS1>
extern volatile __bit                   CLCIN7PPS1          __at(0x7131);	// @ (0xE26 * 8 + 1)
#define                                 CLCIN7PPS1_bit      _BIT_ACCESS(CLCIN7PPS,1)
// CLCIN7PPS<CLCIN7PPS2>
extern volatile __bit                   CLCIN7PPS2          __at(0x7132);	// @ (0xE26 * 8 + 2)
#define                                 CLCIN7PPS2_bit      _BIT_ACCESS(CLCIN7PPS,2)
// CLCIN7PPS<CLCIN7PPS3>
extern volatile __bit                   CLCIN7PPS3          __at(0x7133);	// @ (0xE26 * 8 + 3)
#define                                 CLCIN7PPS3_bit      _BIT_ACCESS(CLCIN7PPS,3)
// CLCIN7PPS<CLCIN7PPS4>
extern volatile __bit                   CLCIN7PPS4          __at(0x7134);	// @ (0xE26 * 8 + 4)
#define                                 CLCIN7PPS4_bit      _BIT_ACCESS(CLCIN7PPS,4)
// CLKRCLK<CLK0>
extern volatile __bit                   CLK0                __at(0x79D0);	// @ (0xF3A * 8 + 0)
#define                                 CLK0_bit            _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLK1>
extern volatile __bit                   CLK1                __at(0x79D1);	// @ (0xF3A * 8 + 1)
#define                                 CLK1_bit            _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLK2>
extern volatile __bit                   CLK2                __at(0x79D2);	// @ (0xF3A * 8 + 2)
#define                                 CLK2_bit            _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x79D0);	// @ (0xF3A * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x79D1);	// @ (0xF3A * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
